<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Imports" data-toc-modified-id="Imports-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Imports</a></span></li><li><span><a href="#Create-Tables" data-toc-modified-id="Create-Tables-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Create Tables</a></span></li><li><span><a href="#Wikibooks-SQL-Exercise:-Employee-management" data-toc-modified-id="Wikibooks-SQL-Exercise:-Employee-management-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Wikibooks SQL Exercise: Employee management</a></span><ul class="toc-item"><li><span><a href="#data:-Departments" data-toc-modified-id="data:-Departments-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>data: Departments</a></span></li><li><span><a href="#data:-Employees" data-toc-modified-id="data:-Employees-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>data: Employees</a></span></li><li><span><a href="#data:-combined-data" data-toc-modified-id="data:-combined-data-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>data: combined data</a></span></li><li><span><a href="#merge-two-dataframes-using-pyspark" data-toc-modified-id="merge-two-dataframes-using-pyspark-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>merge two dataframes using pyspark</a></span></li><li><span><a href="#spark-dataframe-attributes" data-toc-modified-id="spark-dataframe-attributes-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>spark dataframe attributes</a></span></li></ul></li><li><span><a href="#Create-SQL-table-from-spark-dataframes" data-toc-modified-id="Create-SQL-table-from-spark-dataframes-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Create SQL table from spark dataframes</a></span></li><li><span><a href="#Exercise-Questions" data-toc-modified-id="Exercise-Questions-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Exercise Questions</a></span><ul class="toc-item"><li><span><a href="#Select-the-last-name-of-all-employees." data-toc-modified-id="Select-the-last-name-of-all-employees.-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>Select the last name of all employees.</a></span></li><li><span><a href="#Select-the-last-name-of-all-employees,-without-duplicates." data-toc-modified-id="Select-the-last-name-of-all-employees,-without-duplicates.-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>Select the last name of all employees, without duplicates.</a></span></li><li><span><a href="#Select-all-the-data-of-employees-whose-last-name-is-&quot;Smith&quot;." data-toc-modified-id="Select-all-the-data-of-employees-whose-last-name-is-&quot;Smith&quot;.-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>Select all the data of employees whose last name is "Smith".</a></span></li><li><span><a href="#Select-all-the-data-of-employees-whose-last-name-is-&quot;Smith&quot;-or-&quot;Doe&quot;." data-toc-modified-id="Select-all-the-data-of-employees-whose-last-name-is-&quot;Smith&quot;-or-&quot;Doe&quot;.-5.4"><span class="toc-item-num">5.4&nbsp;&nbsp;</span>Select all the data of employees whose last name is "Smith" or "Doe".</a></span></li><li><span><a href="#Select-all-the-data-of-employees-that-work-in-department-14." data-toc-modified-id="Select-all-the-data-of-employees-that-work-in-department-14.-5.5"><span class="toc-item-num">5.5&nbsp;&nbsp;</span>Select all the data of employees that work in department 14.</a></span></li><li><span><a href="#Select-all-the-data-of-employees-that-work-in-department-37-or-department-77." data-toc-modified-id="Select-all-the-data-of-employees-that-work-in-department-37-or-department-77.-5.6"><span class="toc-item-num">5.6&nbsp;&nbsp;</span>Select all the data of employees that work in department 37 or department 77.</a></span></li><li><span><a href="#Select-all-the-data-of-employees-whose-last-name-begins-with-an-&quot;S&quot;." data-toc-modified-id="Select-all-the-data-of-employees-whose-last-name-begins-with-an-&quot;S&quot;.-5.7"><span class="toc-item-num">5.7&nbsp;&nbsp;</span>Select all the data of employees whose last name begins with an "S".</a></span></li><li><span><a href="#Select-the-sum-of-all-the-departments'-budgets." data-toc-modified-id="Select-the-sum-of-all-the-departments'-budgets.-5.8"><span class="toc-item-num">5.8&nbsp;&nbsp;</span>Select the sum of all the departments' budgets.</a></span></li><li><span><a href="#Select-the-number-of-employees-in-each-department-(you-only-need-to-show-the-department-code-and-the-number-of-employees)." data-toc-modified-id="Select-the-number-of-employees-in-each-department-(you-only-need-to-show-the-department-code-and-the-number-of-employees).-5.9"><span class="toc-item-num">5.9&nbsp;&nbsp;</span>Select the number of employees in each department (you only need to show the department code and the number of employees).</a></span></li><li><span><a href="#Select-all-the-data-of-employees,-including-each-employee's-department's-data." data-toc-modified-id="Select-all-the-data-of-employees,-including-each-employee's-department's-data.-5.10"><span class="toc-item-num">5.10&nbsp;&nbsp;</span>Select all the data of employees, including each employee's department's data.</a></span></li><li><span><a href="#Select-the-name-and-last-name-of-each-employee,-along-with-the-name-and-budget-of-the-employee's-department." data-toc-modified-id="Select-the-name-and-last-name-of-each-employee,-along-with-the-name-and-budget-of-the-employee's-department.-5.11"><span class="toc-item-num">5.11&nbsp;&nbsp;</span>Select the name and last name of each employee, along with the name and budget of the employee's department.</a></span></li><li><span><a href="#Select-the-name-and-last-name-of-employees-working-for-departments-with-a-budget-greater-than-60,000." data-toc-modified-id="Select-the-name-and-last-name-of-employees-working-for-departments-with-a-budget-greater-than-60,000.-5.12"><span class="toc-item-num">5.12&nbsp;&nbsp;</span>Select the name and last name of employees working for departments with a budget greater than 60,000.</a></span></li><li><span><a href="#Select-the-departments-with-a-budget-larger-than-the-average-budget-of-all-the-departments." data-toc-modified-id="Select-the-departments-with-a-budget-larger-than-the-average-budget-of-all-the-departments.-5.13"><span class="toc-item-num">5.13&nbsp;&nbsp;</span>Select the departments with a budget larger than the average budget of all the departments.</a></span></li><li><span><a href="#Select-the-names-of-departments-with-more-than-two-employees." data-toc-modified-id="Select-the-names-of-departments-with-more-than-two-employees.-5.14"><span class="toc-item-num">5.14&nbsp;&nbsp;</span>Select the names of departments with more than two employees.</a></span></li><li><span><a href="#Select-the-name-and-last-name-of-employees-working-for-departments-with-second-lowest-budget." data-toc-modified-id="Select-the-name-and-last-name-of-employees-working-for-departments-with-second-lowest-budget.-5.15"><span class="toc-item-num">5.15&nbsp;&nbsp;</span>Select the name and last name of employees working for departments with second lowest budget.</a></span></li><li><span><a href="#Add-a-new-department-called-&quot;Quality-Assurance&quot;,-with-a-budget-of-40,000-and-departmental-code-11.-Add-an-employee-called-&quot;Mary-Moore&quot;-in-that-department,-with-SSN-847-21-9811." data-toc-modified-id="Add-a-new-department-called-&quot;Quality-Assurance&quot;,-with-a-budget-of-40,000-and-departmental-code-11.-Add-an-employee-called-&quot;Mary-Moore&quot;-in-that-department,-with-SSN-847-21-9811.-5.16"><span class="toc-item-num">5.16&nbsp;&nbsp;</span>Add a new department called "Quality Assurance", with a budget of 40,000 and departmental code 11. Add an employee called "Mary Moore" in that department, with SSN 847-21-9811.</a></span></li><li><span><a href="#Reduce-the-budget-of-all-departments-by-10%." data-toc-modified-id="Reduce-the-budget-of-all-departments-by-10%.-5.17"><span class="toc-item-num">5.17&nbsp;&nbsp;</span>Reduce the budget of all departments by 10%.</a></span></li><li><span><a href="#Reassign-all-employees-from-the-Research-department-(code-77)-to-the-IT-department-(code-14)." data-toc-modified-id="Reassign-all-employees-from-the-Research-department-(code-77)-to-the-IT-department-(code-14).-5.18"><span class="toc-item-num">5.18&nbsp;&nbsp;</span>Reassign all employees from the Research department (code 77) to the IT department (code 14).</a></span></li><li><span><a href="#Delete-from-the-table-all-employees-in-the-IT-department-(code-14)." data-toc-modified-id="Delete-from-the-table-all-employees-in-the-IT-department-(code-14).-5.19"><span class="toc-item-num">5.19&nbsp;&nbsp;</span>Delete from the table all employees in the IT department (code 14).</a></span></li><li><span><a href="#Delete-from-the-table-all-employees-who-work-in-departments-with-a-budget-greater-than-or-equal-to-60,000." data-toc-modified-id="Delete-from-the-table-all-employees-who-work-in-departments-with-a-budget-greater-than-or-equal-to-60,000.-5.20"><span class="toc-item-num">5.20&nbsp;&nbsp;</span>Delete from the table all employees who work in departments with a budget greater than or equal to 60,000.</a></span></li><li><span><a href="#Delete-from-the-table-all-employees." data-toc-modified-id="Delete-from-the-table-all-employees.-5.21"><span class="toc-item-num">5.21&nbsp;&nbsp;</span>Delete from the table all employees.</a></span></li></ul></li><li><span><a href="#Time-taken" data-toc-modified-id="Time-taken-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Time taken</a></span></li></ul></div>

# Imports

https://en.wikibooks.org/wiki/SQL_Exercises/Employee_management

In [1]:
import time
time_start_notebook = time.time()

In [2]:
from bhishan import bp # my personal library

/Users/poudel/miniconda3/envs/dataSc/lib/python3.7/site-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [3]:
import numpy as np
import pandas as pd

import functools # reduce

In [4]:
# pyspark
import pyspark
spark = pyspark.sql.SparkSession.builder.appName('bhishan').getOrCreate()
print([(x.__name__,x.__version__) for x in [np, pd, pyspark]])

# sql
# sql
from pyspark.sql.functions import col as _col
from pyspark.sql.functions import udf # @udf("integer") def myfunc(x,y): return x - y
from pyspark.sql import functions as F # stddev format_number date_format, dayofyear, when
from pyspark.sql.window import Window

from pyspark.sql.functions import (mean as _mean, min as _min,
                                   max as _max, avg as _avg,
                                   when as _when
                                  )

from pyspark.sql.types import StructField, StringType, IntegerType,  FloatType, StructType

[('numpy', '1.18.1'), ('pandas', '1.0.1'), ('pyspark', '2.4.4')]

In [5]:
from pyspark import SparkConf, SparkContext, SQLContext

spark = pyspark.sql.SparkSession.builder.appName('bhishan').getOrCreate()
sc = spark.sparkContext
sqlContext = SQLContext(sc) # spark_df = sqlContext.createDataFrame(pandas_df)
sc.setLogLevel("INFO")

In [6]:
import os
import yaml

with open( os.path.expanduser('~') + "/.postgres_conf.yml", 'r') as stream:
    try:
        yaml_dict = yaml.safe_load(stream)
    except yaml.YAMLError as exc:
        print(exc)

pw = yaml_dict['password']

In [7]:
%load_ext sql

In [8]:
%sql postgres://postgres:$pw@localhost:5432/dvdrental

'Connected: postgres@dvdrental'

# Create Tables

In [9]:
'''
We do in only once. We can not drop table here, but we can drop table in pgadmin.


%%sql

-- ----------------------------
--  Table structure for Departments
-- ----------------------------
-- DROP TABLE IF EXISTS Departments;
-- DROP TABLE IF EXISTS Employees;
-- drop table gives error in jupyter notebook.


CREATE TABLE Departments (
  Code INTEGER PRIMARY KEY,
  Name varchar(255) NOT NULL ,
  Budget decimal NOT NULL 
);

CREATE TABLE Employees (
  SSN INTEGER PRIMARY KEY,
  Name varchar(255) NOT NULL ,
  LastName varchar(255) NOT NULL ,
  Department INTEGER NOT NULL , 
  foreign key (department) references Departments(Code) 
);

''';

In [10]:
'''
We do it only once.


%%sql
INSERT INTO Departments(Code,Name,Budget) VALUES(14,'IT',65000);
INSERT INTO Departments(Code,Name,Budget) VALUES(37,'Accounting',15000);
INSERT INTO Departments(Code,Name,Budget) VALUES(59,'Human Resources',240000);
INSERT INTO Departments(Code,Name,Budget) VALUES(77,'Research',55000);

INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('123234877','Michael','Rogers',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('152934485','Anand','Manikutty',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('222364883','Carol','Smith',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('326587417','Joe','Stevens',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332154719','Mary-Anne','Foster',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332569843','George','O''Donnell',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('546523478','John','Doe',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('631231482','David','Smith',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('654873219','Zacary','Efron',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('745685214','Eric','Goldsmith',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657245','Elizabeth','Doe',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657246','Kumar','Swamy',14);
''';

# Wikibooks SQL Exercise: Employee management
Relational Schema
<img src="https://upload.wikimedia.org/wikipedia/commons/3/36/Employees.png" alt="Employees" width="50%" class="center"/>

## data: Departments

In [11]:
%%sql
select * from Departments;

 * postgres://postgres:***@localhost:5432/dvdrental
4 rows affected.

[(14, 'IT', Decimal('65000')),
 (37, 'Accounting', Decimal('15000')),
 (59, 'Human Resources', Decimal('240000')),
 (77, 'Research', Decimal('55000'))]

In [12]:
dfd = pd.DataFrame({'code': [14, 37, 59, 77],
          'name': ['IT', 'Accounting', 'Human Resources', 'Research'],
          'budget': [65000, 15000, 240000, 55000]})
dfd

   code             name  budget
0    14               IT   65000
1    37       Accounting   15000
2    59  Human Resources  240000
3    77         Research   55000

In [13]:
dfd.dtypes

code       int64
name      object
budget     int64
dtype: object

In [14]:
schema = StructType([
    StructField('code',IntegerType(),True),
    StructField('name',StringType(),True),
    StructField('budget',IntegerType(),True),
    ])

sdfd = sqlContext.createDataFrame(dfd, schema)
sdfd.show()

+----+---------------+------+
|code|           name|budget|
+----+---------------+------+
|  14|             IT| 65000|
|  37|     Accounting| 15000|
|  59|Human Resources|240000|
|  77|       Research| 55000|
+----+---------------+------+

## data: Employees

In [15]:
%%sql
select * from Employees;

 * postgres://postgres:***@localhost:5432/dvdrental
12 rows affected.

[(123234877, 'Michael', 'Rogers', 14),
 (152934485, 'Anand', 'Manikutty', 14),
 (222364883, 'Carol', 'Smith', 37),
 (326587417, 'Joe', 'Stevens', 37),
 (332154719, 'Mary-Anne', 'Foster', 14),
 (332569843, 'George', "O'Donnell", 77),
 (546523478, 'John', 'Doe', 59),
 (631231482, 'David', 'Smith', 77),
 (654873219, 'Zacary', 'Efron', 59),
 (745685214, 'Eric', 'Goldsmith', 59),
 (845657245, 'Elizabeth', 'Doe', 14),
 (845657246, 'Kumar', 'Swamy', 14)]

In [16]:
dfe = pd.DataFrame({'ssn': [123234877, 152934485, 222364883, 326587417, 332154719, 332569843, 546523478, 631231482, 654873219, 745685214, 845657245, 845657246],
          'name': ['Michael', 'Anp.nand', 'Carol', 'Joe', 'Mary-Anne', 'George', 'John', 'David', 'Zacary', 'Eric', 'Elizabeth', 'Kumar'],
          'lastname': ['Rogers', 'Manikutty', 'Smith', 'Stevens', 'Foster', "O'Donnell", 'Doe', 'Smith', 'Efron', 'Goldsmith', 'Doe', 'Swamy'],
          'department': [14, 14, 37, 37, 14, 77, 59, 77, 59, 59, 14, 14]})
dfe

          ssn       name   lastname  department
0   123234877    Michael     Rogers          14
1   152934485   Anp.nand  Manikutty          14
2   222364883      Carol      Smith          37
3   326587417        Joe    Stevens          37
4   332154719  Mary-Anne     Foster          14
5   332569843     George  O'Donnell          77
6   546523478       John        Doe          59
7   631231482      David      Smith          77
8   654873219     Zacary      Efron          59
9   745685214       Eric  Goldsmith          59
10  845657245  Elizabeth        Doe          14
11  845657246      Kumar      Swamy          14

In [17]:
dfe.dtypes

ssn            int64
name          object
lastname      object
department     int64
dtype: object

In [18]:
schema = StructType([
    StructField('ssn',IntegerType(),True),
    StructField('name',StringType(),True),
    StructField('lastname',StringType(),True),
    StructField('department',IntegerType(),True),
    ])

sdfe = sqlContext.createDataFrame(dfe, schema)
sdfe.show()

+---------+---------+---------+----------+
|      ssn|     name| lastname|department|
+---------+---------+---------+----------+
|123234877|  Michael|   Rogers|        14|
|152934485| Anp.nand|Manikutty|        14|
|222364883|    Carol|    Smith|        37|
|326587417|      Joe|  Stevens|        37|
|332154719|Mary-Anne|   Foster|        14|
|332569843|   George|O'Donnell|        77|
|546523478|     John|      Doe|        59|
|631231482|    David|    Smith|        77|
|654873219|   Zacary|    Efron|        59|
|745685214|     Eric|Goldsmith|        59|
|845657245|Elizabeth|      Doe|        14|
|845657246|    Kumar|    Swamy|        14|
+---------+---------+---------+----------+

## data: combined data

In [19]:
df = dfd.merge(dfe,left_on='code', right_on='department',suffixes=['_dept','_emp'])
df

    code        name_dept  budget        ssn   name_emp   lastname  department
0     14               IT   65000  123234877    Michael     Rogers          14
1     14               IT   65000  152934485   Anp.nand  Manikutty          14
2     14               IT   65000  332154719  Mary-Anne     Foster          14
3     14               IT   65000  845657245  Elizabeth        Doe          14
4     14               IT   65000  845657246      Kumar      Swamy          14
5     37       Accounting   15000  222364883      Carol      Smith          37
6     37       Accounting   15000  326587417        Joe    Stevens          37
7     59  Human Resources  240000  546523478       John        Doe          59
8     59  Human Resources  240000  654873219     Zacary      Efron          59
9     59  Human Resources  240000  745685214       Eric  Goldsmith          59
10    77         Research   55000  332569843     George  O'Donnell          77
11    77         Research   55000  631231482      David      Smith          77

## merge two dataframes using pyspark

In [20]:
import functools

In [21]:
sdfd.show(2)

+----+----------+------+
|code|      name|budget|
+----+----------+------+
|  14|        IT| 65000|
|  37|Accounting| 15000|
+----+----------+------+
only showing top 2 rows

In [22]:
sdfe.show(2)

+---------+--------+---------+----------+
|      ssn|    name| lastname|department|
+---------+--------+---------+----------+
|123234877| Michael|   Rogers|        14|
|152934485|Anp.nand|Manikutty|        14|
+---------+--------+---------+----------+
only showing top 2 rows

In [23]:
# we will merge departments.code with employee.department

In [24]:
# but there is a problem, both dataframes have some common columns.

In [25]:
cols_dept = sdfd.columns
cols_emp  = sdfe.columns
cols_common = set(cols_dept) & set(cols_emp)
cols_dept, cols_emp, cols_common

(['code', 'name', 'budget'],
 ['ssn', 'name', 'lastname', 'department'],
 {'name'})

In [26]:
# rename common columns of first spark dataframe.

In [27]:
oldColumns = list(cols_common)
newColumns = [i + '_dept' for i in oldColumns]

sdfd2 = functools.reduce(lambda data, idx: data.withColumnRenamed(oldColumns[idx],
                                                                 newColumns[idx]),
                        range(len(oldColumns)),
                        sdfd
                       )
sdfd2.show(2)

+----+----------+------+
|code| name_dept|budget|
+----+----------+------+
|  14|        IT| 65000|
|  37|Accounting| 15000|
+----+----------+------+
only showing top 2 rows

In [28]:
# rename common columns of second spark dataframe.

In [29]:
oldColumns = list(cols_common)
newColumns = [i + '_emp' for i in oldColumns]

sdfe2 = functools.reduce(lambda data, idx: data.withColumnRenamed(oldColumns[idx],
                                                                 newColumns[idx]),
                        range(len(oldColumns)),
                        sdfe
                       )


sdfe2.show(2)

+---------+--------+---------+----------+
|      ssn|name_emp| lastname|department|
+---------+--------+---------+----------+
|123234877| Michael|   Rogers|        14|
|152934485|Anp.nand|Manikutty|        14|
+---------+--------+---------+----------+
only showing top 2 rows

In [30]:
# now join two spark dataframes which have different column names.

In [31]:
sdf = sdfd2.join(sdfe2,sdfd2.code==sdfe2.department)
sdf.show()

+----+---------------+------+---------+---------+---------+----------+
|code|      name_dept|budget|      ssn| name_emp| lastname|department|
+----+---------------+------+---------+---------+---------+----------+
|  37|     Accounting| 15000|222364883|    Carol|    Smith|        37|
|  37|     Accounting| 15000|326587417|      Joe|  Stevens|        37|
|  59|Human Resources|240000|546523478|     John|      Doe|        59|
|  59|Human Resources|240000|654873219|   Zacary|    Efron|        59|
|  59|Human Resources|240000|745685214|     Eric|Goldsmith|        59|
|  77|       Research| 55000|332569843|   George|O'Donnell|        77|
|  77|       Research| 55000|631231482|    David|    Smith|        77|
|  14|             IT| 65000|123234877|  Michael|   Rogers|        14|
|  14|             IT| 65000|152934485| Anp.nand|Manikutty|        14|
|  14|             IT| 65000|332154719|Mary-Anne|   Foster|        14|
|  14|             IT| 65000|845657245|Elizabeth|      Doe|        14|
|  14|             IT| 65000|845657246|    Kumar|    Swamy|        14|
+----+---------------+------+---------+---------+---------+----------+

## spark dataframe attributes

In [32]:
bp.show_method_attributes(sdf,4)
# count, fillna, filter, where, groubpy, first, corr,
# missing than pandas: max, min, sum, etc.

,0,1,2,3
0,agg,dropDuplicates,join,sortWithinPartitions
1,alias,drop_duplicates,limit,sql_ctx
2,approxQuantile,dropna,localCheckpoint,stat
3,cache,dtypes,na,storageLevel
4,checkpoint,exceptAll,orderBy,subtract
5,coalesce,explain,persist,summary
6,colRegex,fillna,printSchema,take
7,collect,filter,randomSplit,toDF
8,columns,first,rdd,toJSON
9,corr,foreach,registerTempTable,toLocalIterator
10,count,foreachPartition,repartition,toPandas
11,cov,freqItems,repartitionByRange,union
12,createGlobalTempView,groupBy,replace,unionAll
13,createOrReplaceGlobalTempView,groupby,rollup,unionByName
14,createOrReplaceTempView,head,sample,unpersist
15,createTempView,hint,sampleBy,where
16,crossJoin,intersect,schema,withColumn
17,crosstab,intersectAll,select,withColumnRenamed
18,cube,isLocal,selectExpr,withWatermark
19,describe,isStreaming,show,write
20,distinct,is_cached,sort,writeStream
21,drop,,,

# Create SQL table from spark dataframes

- https://spark.apache.org/docs/2.2.0/sql-programming-guide.html

**Global Temporary View** 

Temporary views in Spark SQL are session-scoped and will disappear if the session that creates it terminates. If you want to have a temporary view that is shared among all sessions and keep alive until the Spark application terminates, you can create a global temporary view. Global temporary view is tied to a system preserved database global_temp, and we must use the qualified name to refer it, e.g. `SELECT * FROM global_temp.view1`.

In [33]:
# Register the DataFrame as a SQL temporary view
sdfd.createOrReplaceTempView("Departments")
sdfe.createOrReplaceTempView("Employees")

spark.sql('select * from Departments limit 2').show()

+----+----------+------+
|code|      name|budget|
+----+----------+------+
|  14|        IT| 65000|
|  37|Accounting| 15000|
+----+----------+------+

# Exercise Questions

##  Select the last name of all employees.

In [34]:
dfe[['lastname']]

     lastname
0      Rogers
1   Manikutty
2       Smith
3     Stevens
4      Foster
5   O'Donnell
6         Doe
7       Smith
8       Efron
9   Goldsmith
10        Doe
11      Swamy

In [35]:
%%sql
select lastname from Employees;

 * postgres://postgres:***@localhost:5432/dvdrental
12 rows affected.

[('Rogers',),
 ('Manikutty',),
 ('Smith',),
 ('Stevens',),
 ('Foster',),
 ("O'Donnell",),
 ('Doe',),
 ('Smith',),
 ('Efron',),
 ('Goldsmith',),
 ('Doe',),
 ('Swamy',)]

In [36]:
sdfe[['lastname']].show(2)

+---------+
| lastname|
+---------+
|   Rogers|
|Manikutty|
+---------+
only showing top 2 rows

## Select the last name of all employees, without duplicates.

In [37]:
dfe[['lastname']].drop_duplicates()

     lastname
0      Rogers
1   Manikutty
2       Smith
3     Stevens
4      Foster
5   O'Donnell
6         Doe
8       Efron
9   Goldsmith
11      Swamy

In [38]:
%%sql
select distinct lastname from Employees;

 * postgres://postgres:***@localhost:5432/dvdrental
10 rows affected.

[('Doe',),
 ("O'Donnell",),
 ('Rogers',),
 ('Foster',),
 ('Smith',),
 ('Goldsmith',),
 ('Stevens',),
 ('Efron',),
 ('Swamy',),
 ('Manikutty',)]

In [39]:
sdfe[['lastname']].drop_duplicates().show()

+---------+
| lastname|
+---------+
|Goldsmith|
|    Smith|
|   Foster|
|      Doe|
|   Rogers|
|    Efron|
|  Stevens|
|    Swamy|
|O'Donnell|
|Manikutty|
+---------+

## Select all the data of employees whose last name is "Smith".

In [40]:
dfe[dfe.lastname=='Smith']

         ssn   name lastname  department
2  222364883  Carol    Smith          37
7  631231482  David    Smith          77

In [41]:
%%sql
select * from Employees
where lastname = 'Smith'

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(222364883, 'Carol', 'Smith', 37), (631231482, 'David', 'Smith', 77)]

In [42]:
sdfe[sdfe.lastname=='Smith'].show()

+---------+-----+--------+----------+
|      ssn| name|lastname|department|
+---------+-----+--------+----------+
|222364883|Carol|   Smith|        37|
|631231482|David|   Smith|        77|
+---------+-----+--------+----------+

## Select all the data of employees whose last name is "Smith" or "Doe".

In [43]:
dfe[ (dfe.lastname=='Smith') | (dfe.lastname=='Doe')]

          ssn       name lastname  department
2   222364883      Carol    Smith          37
6   546523478       John      Doe          59
7   631231482      David    Smith          77
10  845657245  Elizabeth      Doe          14

In [44]:
%%sql
select * from Employees
where lastname = 'Smith' or lastname = 'Doe'

 * postgres://postgres:***@localhost:5432/dvdrental
4 rows affected.

[(222364883, 'Carol', 'Smith', 37),
 (546523478, 'John', 'Doe', 59),
 (631231482, 'David', 'Smith', 77),
 (845657245, 'Elizabeth', 'Doe', 14)]

In [45]:
%%sql
select * from Employees
where lastname in ('Smith', 'Doe')

 * postgres://postgres:***@localhost:5432/dvdrental
4 rows affected.

[(222364883, 'Carol', 'Smith', 37),
 (546523478, 'John', 'Doe', 59),
 (631231482, 'David', 'Smith', 77),
 (845657245, 'Elizabeth', 'Doe', 14)]

In [46]:
sdfe[ (sdfe.lastname=='Smith') | (sdfe.lastname=='Doe')].show()

+---------+---------+--------+----------+
|      ssn|     name|lastname|department|
+---------+---------+--------+----------+
|222364883|    Carol|   Smith|        37|
|546523478|     John|     Doe|        59|
|631231482|    David|   Smith|        77|
|845657245|Elizabeth|     Doe|        14|
+---------+---------+--------+----------+

## Select all the data of employees that work in department 14.

In [47]:
dfe[dfe.department==14]

          ssn       name   lastname  department
0   123234877    Michael     Rogers          14
1   152934485   Anp.nand  Manikutty          14
4   332154719  Mary-Anne     Foster          14
10  845657245  Elizabeth        Doe          14
11  845657246      Kumar      Swamy          14

In [48]:
%%sql
select * from Employees
where department= 14

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(123234877, 'Michael', 'Rogers', 14),
 (152934485, 'Anand', 'Manikutty', 14),
 (332154719, 'Mary-Anne', 'Foster', 14),
 (845657245, 'Elizabeth', 'Doe', 14),
 (845657246, 'Kumar', 'Swamy', 14)]

In [49]:
sdfe[sdfe.department==14].show()

+---------+---------+---------+----------+
|      ssn|     name| lastname|department|
+---------+---------+---------+----------+
|123234877|  Michael|   Rogers|        14|
|152934485| Anp.nand|Manikutty|        14|
|332154719|Mary-Anne|   Foster|        14|
|845657245|Elizabeth|      Doe|        14|
|845657246|    Kumar|    Swamy|        14|
+---------+---------+---------+----------+

## Select all the data of employees that work in department 37 or department 77.

In [50]:
dfe[(dfe.department==37) | (dfe.department==77)]

         ssn    name   lastname  department
2  222364883   Carol      Smith          37
3  326587417     Joe    Stevens          37
5  332569843  George  O'Donnell          77
7  631231482   David      Smith          77

In [51]:
dfe[dfe.department.isin([37,77])]

         ssn    name   lastname  department
2  222364883   Carol      Smith          37
3  326587417     Joe    Stevens          37
5  332569843  George  O'Donnell          77
7  631231482   David      Smith          77

In [52]:
dfe.query('department in [37,77]')

         ssn    name   lastname  department
2  222364883   Carol      Smith          37
3  326587417     Joe    Stevens          37
5  332569843  George  O'Donnell          77
7  631231482   David      Smith          77

In [53]:
%%sql
select * from Employees
where department=37 or department=77

 * postgres://postgres:***@localhost:5432/dvdrental
4 rows affected.

[(222364883, 'Carol', 'Smith', 37),
 (326587417, 'Joe', 'Stevens', 37),
 (332569843, 'George', "O'Donnell", 77),
 (631231482, 'David', 'Smith', 77)]

In [54]:
sdfe[(sdfe.department==37) | (sdfe.department==77)].show()

+---------+------+---------+----------+
|      ssn|  name| lastname|department|
+---------+------+---------+----------+
|222364883| Carol|    Smith|        37|
|326587417|   Joe|  Stevens|        37|
|332569843|George|O'Donnell|        77|
|631231482| David|    Smith|        77|
+---------+------+---------+----------+

In [55]:
sdfe[ sdfe.department.isin(37,77)].show()

+---------+------+---------+----------+
|      ssn|  name| lastname|department|
+---------+------+---------+----------+
|222364883| Carol|    Smith|        37|
|326587417|   Joe|  Stevens|        37|
|332569843|George|O'Donnell|        77|
|631231482| David|    Smith|        77|
+---------+------+---------+----------+

## Select all the data of employees whose last name begins with an "S".

In [56]:
dfe[dfe.lastname.str.startswith("S")]

          ssn   name lastname  department
2   222364883  Carol    Smith          37
3   326587417    Joe  Stevens          37
7   631231482  David    Smith          77
11  845657246  Kumar    Swamy          14

In [57]:
%%sql
select * from Employees
where lastname like 'S%'

 * postgres://postgres:***@localhost:5432/dvdrental
4 rows affected.

[(222364883, 'Carol', 'Smith', 37),
 (326587417, 'Joe', 'Stevens', 37),
 (631231482, 'David', 'Smith', 77),
 (845657246, 'Kumar', 'Swamy', 14)]

In [58]:
sdfe.filter(_col('lastname').startswith('S')).show()

+---------+-----+--------+----------+
|      ssn| name|lastname|department|
+---------+-----+--------+----------+
|222364883|Carol|   Smith|        37|
|326587417|  Joe| Stevens|        37|
|631231482|David|   Smith|        77|
|845657246|Kumar|   Swamy|        14|
+---------+-----+--------+----------+

## Select the sum of all the departments' budgets.

In [59]:
dfd

   code             name  budget
0    14               IT   65000
1    37       Accounting   15000
2    59  Human Resources  240000
3    77         Research   55000

In [60]:
dfd.budget.sum()

375000

In [61]:
%%sql
select sum(budget) from Departments;

 * postgres://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(Decimal('375000'),)]

In [62]:
sdfd.select(_max(_col('budget'))).show()

+-----------+
|max(budget)|
+-----------+
|     240000|
+-----------+

In [63]:
sdfd.agg({'budget':'max'}).show()

+-----------+
|max(budget)|
+-----------+
|     240000|
+-----------+

In [64]:
sdfd.agg({'budget':'max'}).collect()[0][0]

240000

## Select the number of employees in each department (you only need to show the department code and the number of employees).

In [65]:
dfe

          ssn       name   lastname  department
0   123234877    Michael     Rogers          14
1   152934485   Anp.nand  Manikutty          14
2   222364883      Carol      Smith          37
3   326587417        Joe    Stevens          37
4   332154719  Mary-Anne     Foster          14
5   332569843     George  O'Donnell          77
6   546523478       John        Doe          59
7   631231482      David      Smith          77
8   654873219     Zacary      Efron          59
9   745685214       Eric  Goldsmith          59
10  845657245  Elizabeth        Doe          14
11  845657246      Kumar      Swamy          14

In [66]:
dfe.groupby('department')[['ssn']].count()

            ssn
department
14            5
37            2
59            3
77            2

In [67]:
%%sql
select department, count(*) 
from Employees
group by department

 * postgres://postgres:***@localhost:5432/dvdrental
4 rows affected.

[(14, 5), (59, 3), (77, 2), (37, 2)]

In [68]:
sdfe.groupby('department').count().show()

+----------+-----+
|department|count|
+----------+-----+
|        37|    2|
|        59|    3|
|        77|    2|
|        14|    5|
+----------+-----+

In [69]:
sdfe.groupBy('department').count()\
.select('department', _col('count').alias('n')).show()

+----------+---+
|department|  n|
+----------+---+
|        37|  2|
|        59|  3|
|        77|  2|
|        14|  5|
+----------+---+

In [70]:
sdfe.show(2)

+---------+--------+---------+----------+
|      ssn|    name| lastname|department|
+---------+--------+---------+----------+
|123234877| Michael|   Rogers|        14|
|152934485|Anp.nand|Manikutty|        14|
+---------+--------+---------+----------+
only showing top 2 rows

## Select all the data of employees, including each employee's department's data.

In [71]:
df

    code        name_dept  budget        ssn   name_emp   lastname  department
0     14               IT   65000  123234877    Michael     Rogers          14
1     14               IT   65000  152934485   Anp.nand  Manikutty          14
2     14               IT   65000  332154719  Mary-Anne     Foster          14
3     14               IT   65000  845657245  Elizabeth        Doe          14
4     14               IT   65000  845657246      Kumar      Swamy          14
5     37       Accounting   15000  222364883      Carol      Smith          37
6     37       Accounting   15000  326587417        Joe    Stevens          37
7     59  Human Resources  240000  546523478       John        Doe          59
8     59  Human Resources  240000  654873219     Zacary      Efron          59
9     59  Human Resources  240000  745685214       Eric  Goldsmith          59
10    77         Research   55000  332569843     George  O'Donnell          77
11    77         Research   55000  631231482      David      Smith          77

In [72]:
%%sql
select * 
from Departments D, Employees E
where D.code = E.department

 * postgres://postgres:***@localhost:5432/dvdrental
12 rows affected.

[(14, 'IT', Decimal('65000'), 845657246, 'Kumar', 'Swamy', 14),
 (14, 'IT', Decimal('65000'), 845657245, 'Elizabeth', 'Doe', 14),
 (14, 'IT', Decimal('65000'), 332154719, 'Mary-Anne', 'Foster', 14),
 (14, 'IT', Decimal('65000'), 152934485, 'Anand', 'Manikutty', 14),
 (14, 'IT', Decimal('65000'), 123234877, 'Michael', 'Rogers', 14),
 (37, 'Accounting', Decimal('15000'), 326587417, 'Joe', 'Stevens', 37),
 (37, 'Accounting', Decimal('15000'), 222364883, 'Carol', 'Smith', 37),
 (59, 'Human Resources', Decimal('240000'), 745685214, 'Eric', 'Goldsmith', 59),
 (59, 'Human Resources', Decimal('240000'), 654873219, 'Zacary', 'Efron', 59),
 (59, 'Human Resources', Decimal('240000'), 546523478, 'John', 'Doe', 59),
 (77, 'Research', Decimal('55000'), 631231482, 'David', 'Smith', 77),
 (77, 'Research', Decimal('55000'), 332569843, 'George', "O'Donnell", 77)]

In [73]:
# I have already created sdf
sdf.show()

+----+---------------+------+---------+---------+---------+----------+
|code|      name_dept|budget|      ssn| name_emp| lastname|department|
+----+---------------+------+---------+---------+---------+----------+
|  37|     Accounting| 15000|222364883|    Carol|    Smith|        37|
|  37|     Accounting| 15000|326587417|      Joe|  Stevens|        37|
|  59|Human Resources|240000|546523478|     John|      Doe|        59|
|  59|Human Resources|240000|654873219|   Zacary|    Efron|        59|
|  59|Human Resources|240000|745685214|     Eric|Goldsmith|        59|
|  77|       Research| 55000|332569843|   George|O'Donnell|        77|
|  77|       Research| 55000|631231482|    David|    Smith|        77|
|  14|             IT| 65000|123234877|  Michael|   Rogers|        14|
|  14|             IT| 65000|152934485| Anp.nand|Manikutty|        14|
|  14|             IT| 65000|332154719|Mary-Anne|   Foster|        14|
|  14|             IT| 65000|845657245|Elizabeth|      Doe|        14|
|  14|             IT| 65000|845657246|    Kumar|    Swamy|        14|
+----+---------------+------+---------+---------+---------+----------+

## Select the name and last name of each employee, along with the name and budget of the employee's department.

In [74]:
df.head(2)

   code name_dept  budget        ssn  name_emp   lastname  department
0    14        IT   65000  123234877   Michael     Rogers          14
1    14        IT   65000  152934485  Anp.nand  Manikutty          14

In [75]:
df[['name_emp','lastname','name_dept','budget']]
# df.filter(['name_emp','lastname','name_dept','budget'])

     name_emp   lastname        name_dept  budget
0     Michael     Rogers               IT   65000
1    Anp.nand  Manikutty               IT   65000
2   Mary-Anne     Foster               IT   65000
3   Elizabeth        Doe               IT   65000
4       Kumar      Swamy               IT   65000
5       Carol      Smith       Accounting   15000
6         Joe    Stevens       Accounting   15000
7        John        Doe  Human Resources  240000
8      Zacary      Efron  Human Resources  240000
9        Eric  Goldsmith  Human Resources  240000
10     George  O'Donnell         Research   55000
11      David      Smith         Research   55000

In [76]:
%%sql
select * from Employees limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(123234877, 'Michael', 'Rogers', 14), (152934485, 'Anand', 'Manikutty', 14)]

In [77]:
%%sql
select * from Departments limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(14, 'IT', Decimal('65000')), (37, 'Accounting', Decimal('15000'))]

In [78]:
%%sql
select e.name as name_emp, e.lastname as lastname,
       d.name as name_dep, d.budget as budget
       
from Employees e inner join Departments d
on e.department = d.code

 * postgres://postgres:***@localhost:5432/dvdrental
12 rows affected.

[('Kumar', 'Swamy', 'IT', Decimal('65000')),
 ('Elizabeth', 'Doe', 'IT', Decimal('65000')),
 ('Mary-Anne', 'Foster', 'IT', Decimal('65000')),
 ('Anand', 'Manikutty', 'IT', Decimal('65000')),
 ('Michael', 'Rogers', 'IT', Decimal('65000')),
 ('Joe', 'Stevens', 'Accounting', Decimal('15000')),
 ('Carol', 'Smith', 'Accounting', Decimal('15000')),
 ('Eric', 'Goldsmith', 'Human Resources', Decimal('240000')),
 ('Zacary', 'Efron', 'Human Resources', Decimal('240000')),
 ('John', 'Doe', 'Human Resources', Decimal('240000')),
 ('David', 'Smith', 'Research', Decimal('55000')),
 ('George', "O'Donnell", 'Research', Decimal('55000'))]

In [79]:
sdf.show(2)

+----+----------+------+---------+--------+--------+----------+
|code| name_dept|budget|      ssn|name_emp|lastname|department|
+----+----------+------+---------+--------+--------+----------+
|  37|Accounting| 15000|222364883|   Carol|   Smith|        37|
|  37|Accounting| 15000|326587417|     Joe| Stevens|        37|
+----+----------+------+---------+--------+--------+----------+
only showing top 2 rows

In [80]:
sdf[['name_emp', 'lastname','name_dept','budget']].show()

+---------+---------+---------------+------+
| name_emp| lastname|      name_dept|budget|
+---------+---------+---------------+------+
|    Carol|    Smith|     Accounting| 15000|
|      Joe|  Stevens|     Accounting| 15000|
|     John|      Doe|Human Resources|240000|
|   Zacary|    Efron|Human Resources|240000|
|     Eric|Goldsmith|Human Resources|240000|
|   George|O'Donnell|       Research| 55000|
|    David|    Smith|       Research| 55000|
|  Michael|   Rogers|             IT| 65000|
| Anp.nand|Manikutty|             IT| 65000|
|Mary-Anne|   Foster|             IT| 65000|
|Elizabeth|      Doe|             IT| 65000|
|    Kumar|    Swamy|             IT| 65000|
+---------+---------+---------------+------+

In [81]:
# sdf.select(['name_emp', 'lastname','name_dept','budget']).show()

In [82]:
(sdfe.selectExpr('name as name_emp', 'lastname', 'department').alias('E')
.join(
    sdfd.selectExpr('name as name_dept','budget','code').alias('D'),
    _col('E.department') == _col('D.code')
      )
.drop('department','code')
.show()
)

+---------+---------+---------------+------+
| name_emp| lastname|      name_dept|budget|
+---------+---------+---------------+------+
|    Carol|    Smith|     Accounting| 15000|
|      Joe|  Stevens|     Accounting| 15000|
|     John|      Doe|Human Resources|240000|
|   Zacary|    Efron|Human Resources|240000|
|     Eric|Goldsmith|Human Resources|240000|
|   George|O'Donnell|       Research| 55000|
|    David|    Smith|       Research| 55000|
|  Michael|   Rogers|             IT| 65000|
| Anp.nand|Manikutty|             IT| 65000|
|Mary-Anne|   Foster|             IT| 65000|
|Elizabeth|      Doe|             IT| 65000|
|    Kumar|    Swamy|             IT| 65000|
+---------+---------+---------------+------+

In [83]:
spark.sql("""
select e.name as name_emp, e.lastname as lastname,
       d.name as name_dep, d.budget as budget
       
from Employees e inner join Departments d
on e.department = d.code
"""
).show()

+---------+---------+---------------+------+
| name_emp| lastname|       name_dep|budget|
+---------+---------+---------------+------+
|    Carol|    Smith|     Accounting| 15000|
|      Joe|  Stevens|     Accounting| 15000|
|     John|      Doe|Human Resources|240000|
|   Zacary|    Efron|Human Resources|240000|
|     Eric|Goldsmith|Human Resources|240000|
|   George|O'Donnell|       Research| 55000|
|    David|    Smith|       Research| 55000|
|  Michael|   Rogers|             IT| 65000|
| Anp.nand|Manikutty|             IT| 65000|
|Mary-Anne|   Foster|             IT| 65000|
|Elizabeth|      Doe|             IT| 65000|
|    Kumar|    Swamy|             IT| 65000|
+---------+---------+---------------+------+

## Select the name and last name of employees working for departments with a budget greater than 60,000.

In [84]:
dfe.head(2)

         ssn      name   lastname  department
0  123234877   Michael     Rogers          14
1  152934485  Anp.nand  Manikutty          14

In [85]:
df.head(1)

   code name_dept  budget        ssn name_emp lastname  department
0    14        IT   65000  123234877  Michael   Rogers          14

In [86]:
df[df.budget > 60000][['name_emp','lastname']]

    name_emp   lastname
0    Michael     Rogers
1   Anp.nand  Manikutty
2  Mary-Anne     Foster
3  Elizabeth        Doe
4      Kumar      Swamy
7       John        Doe
8     Zacary      Efron
9       Eric  Goldsmith

In [87]:
%%sql
select e.name as name_emp, e.lastname as lastname
from Employees e inner join Departments d
on e.department = d.code
where d.budget > 60000

 * postgres://postgres:***@localhost:5432/dvdrental
8 rows affected.

[('Michael', 'Rogers'),
 ('Anand', 'Manikutty'),
 ('Mary-Anne', 'Foster'),
 ('John', 'Doe'),
 ('Zacary', 'Efron'),
 ('Eric', 'Goldsmith'),
 ('Elizabeth', 'Doe'),
 ('Kumar', 'Swamy')]

In [88]:
%%sql
select e.name as name_emp, e.lastname as lastname
from Employees e inner join Departments d
on e.department = d.code
and d.budget > 60000

 * postgres://postgres:***@localhost:5432/dvdrental
8 rows affected.

[('Michael', 'Rogers'),
 ('Anand', 'Manikutty'),
 ('Mary-Anne', 'Foster'),
 ('John', 'Doe'),
 ('Zacary', 'Efron'),
 ('Eric', 'Goldsmith'),
 ('Elizabeth', 'Doe'),
 ('Kumar', 'Swamy')]

In [89]:
# using subquery

In [90]:
%%sql
select name,lastname from Employees
where (
    department in 
    (
        select code from Departments where budget > 60000
    )
)

 * postgres://postgres:***@localhost:5432/dvdrental
8 rows affected.

[('Michael', 'Rogers'),
 ('Anand', 'Manikutty'),
 ('Mary-Anne', 'Foster'),
 ('John', 'Doe'),
 ('Zacary', 'Efron'),
 ('Eric', 'Goldsmith'),
 ('Elizabeth', 'Doe'),
 ('Kumar', 'Swamy')]

In [91]:
%%sql
select * from Employees limit 1;

 * postgres://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(123234877, 'Michael', 'Rogers', 14)]

In [92]:
sdf[sdf.budget > 60000][['name_emp','lastname']].show()

+---------+---------+
| name_emp| lastname|
+---------+---------+
|     John|      Doe|
|   Zacary|    Efron|
|     Eric|Goldsmith|
|  Michael|   Rogers|
| Anp.nand|Manikutty|
|Mary-Anne|   Foster|
|Elizabeth|      Doe|
|    Kumar|    Swamy|
+---------+---------+

## Select the departments with a budget larger than the average budget of all the departments.

In [93]:
dfd

   code             name  budget
0    14               IT   65000
1    37       Accounting   15000
2    59  Human Resources  240000
3    77         Research   55000

In [94]:
dfd.budget.mean()

93750.0

In [95]:
dfd[dfd.budget > dfd.budget.mean()]

   code             name  budget
2    59  Human Resources  240000

In [96]:
%%sql
select * from Departments
where budget > (
    select avg(budget) from Departments

)

 * postgres://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(59, 'Human Resources', Decimal('240000'))]

In [97]:
sdfd.agg({'budget':'mean'}).show()

+-----------+
|avg(budget)|
+-----------+
|    93750.0|
+-----------+

In [98]:
# fails: dfd[dfd.budget > sdfd.agg({'budget':'mean'})]
dfd[dfd.budget > sdfd.agg({'budget':'mean'}).collect()[0][0]]

   code             name  budget
2    59  Human Resources  240000

## Select the names of departments with more than two employees.

In [99]:
# dept + emp is df
df

    code        name_dept  budget        ssn   name_emp   lastname  department
0     14               IT   65000  123234877    Michael     Rogers          14
1     14               IT   65000  152934485   Anp.nand  Manikutty          14
2     14               IT   65000  332154719  Mary-Anne     Foster          14
3     14               IT   65000  845657245  Elizabeth        Doe          14
4     14               IT   65000  845657246      Kumar      Swamy          14
5     37       Accounting   15000  222364883      Carol      Smith          37
6     37       Accounting   15000  326587417        Joe    Stevens          37
7     59  Human Resources  240000  546523478       John        Doe          59
8     59  Human Resources  240000  654873219     Zacary      Efron          59
9     59  Human Resources  240000  745685214       Eric  Goldsmith          59
10    77         Research   55000  332569843     George  O'Donnell          77
11    77         Research   55000  631231482      David      Smith          77

In [100]:
# df.groupby('department').count() # gives all columns

In [101]:
df.groupby('name_dept')[['code']]\
.count()\
.loc[lambda dfx: dfx['code'] > 2]\
.reset_index().drop('code',axis=1)

         name_dept
0  Human Resources
1               IT

In [102]:
df.groupby('name_dept')\
.filter(lambda dfx: dfx['code'].count() > 2)\
.drop_duplicates('name_dept')\
[['name_dept']]

         name_dept
0               IT
7  Human Resources

In [103]:
df.groupby('department')\
.filter(lambda dfx: all(dfx.count()> 2))\
[['name_dept']]\
.drop_duplicates()

         name_dept
0               IT
7  Human Resources

In [104]:
df [ df.groupby('department')['code'].transform('count') > 2 ][['name_dept']]\
.drop_duplicates()

         name_dept
0               IT
7  Human Resources

In [105]:
%%sql
select * from Departments limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(14, 'IT', Decimal('65000')), (37, 'Accounting', Decimal('15000'))]

In [106]:
%%sql
select * from Employees limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(123234877, 'Michael', 'Rogers', 14), (152934485, 'Anand', 'Manikutty', 14)]

In [107]:
%%sql
select d.name 
from Departments d inner join Employees e
on d.code = e.department
group by d.name
having count(*) > 2

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[('Human Resources',), ('IT',)]

In [108]:
%%sql
select name
from Departments
where code in (
    select department from Employees
    group by department
    having count(*) > 2

)

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[('IT',), ('Human Resources',)]

In [109]:
# spark does not have transform, i need to create new column.

In [110]:
sdf.show()

+----+---------------+------+---------+---------+---------+----------+
|code|      name_dept|budget|      ssn| name_emp| lastname|department|
+----+---------------+------+---------+---------+---------+----------+
|  37|     Accounting| 15000|222364883|    Carol|    Smith|        37|
|  37|     Accounting| 15000|326587417|      Joe|  Stevens|        37|
|  59|Human Resources|240000|546523478|     John|      Doe|        59|
|  59|Human Resources|240000|654873219|   Zacary|    Efron|        59|
|  59|Human Resources|240000|745685214|     Eric|Goldsmith|        59|
|  77|       Research| 55000|332569843|   George|O'Donnell|        77|
|  77|       Research| 55000|631231482|    David|    Smith|        77|
|  14|             IT| 65000|123234877|  Michael|   Rogers|        14|
|  14|             IT| 65000|152934485| Anp.nand|Manikutty|        14|
|  14|             IT| 65000|332154719|Mary-Anne|   Foster|        14|
|  14|             IT| 65000|845657245|Elizabeth|      Doe|        14|
|  14|             IT| 65000|845657246|    Kumar|    Swamy|        14|
+----+---------------+------+---------+---------+---------+----------+

In [111]:
from pyspark.sql.window import Window

window_var = Window().partitionBy('department')
sdf = sdf.withColumn('dept_count', F.count('code').over(window_var))

sdf.show()

+----+---------------+------+---------+---------+---------+----------+----------+
|code|      name_dept|budget|      ssn| name_emp| lastname|department|dept_count|
+----+---------------+------+---------+---------+---------+----------+----------+
|  37|     Accounting| 15000|222364883|    Carol|    Smith|        37|         2|
|  37|     Accounting| 15000|326587417|      Joe|  Stevens|        37|         2|
|  59|Human Resources|240000|546523478|     John|      Doe|        59|         3|
|  59|Human Resources|240000|654873219|   Zacary|    Efron|        59|         3|
|  59|Human Resources|240000|745685214|     Eric|Goldsmith|        59|         3|
|  77|       Research| 55000|332569843|   George|O'Donnell|        77|         2|
|  77|       Research| 55000|631231482|    David|    Smith|        77|         2|
|  14|             IT| 65000|123234877|  Michael|   Rogers|        14|         5|
|  14|             IT| 65000|152934485| Anp.nand|Manikutty|        14|         5|
|  14|             IT| 65000|332154719|Mary-Anne|   Foster|        14|         5|
|  14|             IT| 65000|845657245|Elizabeth|      Doe|        14|         5|
|  14|             IT| 65000|845657246|    Kumar|    Swamy|        14|         5|
+----+---------------+------+---------+---------+---------+----------+----------+

In [112]:
sdf.filter(sdf.dept_count > 2).select('name_dept').drop_duplicates().show()

+---------------+
|      name_dept|
+---------------+
|             IT|
|Human Resources|
+---------------+

In [113]:
sdf.groupby('name_dept').count().filter(F.col('count') > 2).drop('count').show()

+---------------+
|      name_dept|
+---------------+
|             IT|
|Human Resources|
+---------------+

## Select the name and last name of employees working for departments with second lowest budget.

In [114]:
df

    code        name_dept  budget        ssn   name_emp   lastname  department
0     14               IT   65000  123234877    Michael     Rogers          14
1     14               IT   65000  152934485   Anp.nand  Manikutty          14
2     14               IT   65000  332154719  Mary-Anne     Foster          14
3     14               IT   65000  845657245  Elizabeth        Doe          14
4     14               IT   65000  845657246      Kumar      Swamy          14
5     37       Accounting   15000  222364883      Carol      Smith          37
6     37       Accounting   15000  326587417        Joe    Stevens          37
7     59  Human Resources  240000  546523478       John        Doe          59
8     59  Human Resources  240000  654873219     Zacary      Efron          59
9     59  Human Resources  240000  745685214       Eric  Goldsmith          59
10    77         Research   55000  332569843     George  O'Donnell          77
11    77         Research   55000  631231482      David      Smith          77

In [115]:
# df.groupby('department')['budget'].mean()

In [116]:
# df.drop_duplicates('department')

In [ ]:
df['budget'].drop_duplicates().sort_values()

5      15000
10     55000
0      65000
7     240000
Name: budget, dtype: int64

In [ ]:
df['budget'].drop_duplicates().sort_values().iloc[1]

In [ ]:
sec_lowest_budget = df['budget'].drop_duplicates().nsmallest(2).tail(1).to_numpy()[0]
sec_lowest_budget

In [ ]:
df.loc[df.budget==sec_lowest_budget, ['name_emp','lastname']]

In [ ]:
%%sql
select * from Employees limit 2;

In [ ]:
%%sql
select * from Departments limit 2;

In [ ]:
%%sql
select min(budget) from Departments
where budget != (select min(budget) from Departments)

In [ ]:
%%sql
select code from Departments where
budget = (
    select min(budget) from Departments
    where budget != (select min(budget) from Departments)
)

In [ ]:
%%sql
select name, lastname from Employees
where department = (
    select code from Departments where
    budget = (
        select min(budget) from Departments
        where budget != (select min(budget) from Departments)
    )
)

In [ ]:
%%sql

select * from Departments d order by d.budget limit 2

In [ ]:
%%sql
select sub.code
from (select * from Departments d order by d.budget limit 2) sub
order by budget desc limit 1

In [ ]:
%%sql
select e.name, e.lastname
from Employees e
where e.department = (
    select sub.code
    from (select * from Departments d order by d.budget limit 2) sub
    order by budget desc limit 1
)

In [ ]:
sdf.show()

In [ ]:
sdf.select(F.min(F.col('budget'))).show()

In [ ]:
lowest_budget = sdf.select(F.min(F.col('budget'))).collect()[0][0]
lowest_budget

In [ ]:
sdf2 = sdf[sdf.budget != lowest_budget]
sdf2.show()

In [ ]:
sec_lowest_budget = sdf2.select(F.min(F.col('budget'))).collect()[0][0]
sec_lowest_budget

In [ ]:
sdf2[sdf2.budget == sec_lowest_budget].select('name_emp','lastname').show()

In [ ]:
sdf.drop_duplicates(subset=['budget']).orderBy('budget').show()

In [ ]:
sdf.drop_duplicates(subset=['budget']).orderBy('budget')[['budget']].show()

In [ ]:
sec_lowest_budget = sdf.drop_duplicates(subset=['budget']).orderBy('budget')[['budget']].collect()[1][0]

sec_lowest_budget

## Add a new department called "Quality Assurance", with a budget of 40,000 and departmental code 11. Add an employee called "Mary Moore" in that department, with SSN 847-21-9811.

In [ ]:
dfd.head(2)

In [ ]:
df.head(2)

In [ ]:
df.loc[len(df)] = [11,'Quality Assurance',40000,847219811,'Mary','Moore',11]
df

In [ ]:
"""
INSERT INTO Departments
  VALUES ( 11 , 'Quality Assurance' , 40000);

INSERT INTO Employees
  VALUES ( '847219811' , 'Mary' , 'Moore' , 11);

""";

In [ ]:
# pyspark

In [ ]:
"""
spark df and rdd are immutable, we can not insert row to them,
but we can create new dataframe and union to old df and create new immutable dataframe.

""";

In [ ]:
sdf.show(2)

In [ ]:
sdf.columns

In [ ]:
sdf.printSchema()

In [ ]:
from pyspark.sql import Row


newRow = spark.createDataFrame([Row(
            code=11,
            name_dept='Quality Assurance',
            budget=40000,
            ssn=847219811,
            name_emp='Mary',
            lastname='Moore',
            department=11
)])


newRow.show()

In [ ]:
sdf.drop('dept_count').show()

In [ ]:
sdf.drop('dept_count').union(
    newRow[['code',
 'name_dept',
 'budget',
 'ssn',
 'name_emp',
 'lastname',
 'department']]
).show()

## Reduce the budget of all departments by 10%.

In [ ]:
dfd.head(2)

In [ ]:
dfd['budget'] *= 0.9
dfd.head(2)

In [ ]:
"""

UPDATE Departments
SET Budget = Budget * 0.9;
""";

In [ ]:
sdfd.withColumn('reduced_budget', F.col('budget')*0.9).show()

## Reassign all employees from the Research department (code 77) to the IT department (code 14).

In [ ]:
df

In [ ]:
df.loc[df.name_dept=='Research', ['code','name_dept','department']] = [14,'IT',14]
df

In [ ]:
dfe

In [ ]:
dfe.loc[dfe.department==77] = 14
dfe

In [ ]:
"""
UPDATE Employees 
SET Department = 14 WHERE Department = 77;
""";

In [ ]:
sdfe.withColumn("dept_changed",
                F.when(F.col("department")==77, 14)\
                 .otherwise(F.col("department"))
               ).show()

## Delete from the table all employees in the IT department (code 14).

In [ ]:
dfe

In [ ]:
dfe[dfe.department!=14]

In [ ]:
"""

DELETE FROM Employees
  WHERE Department = 14;
""";

In [ ]:
sdfe[sdfe.department!=14].show()

## Delete from the table all employees who work in departments with a budget greater than or equal to 60,000.

In [ ]:
dfd

In [ ]:
dfd[dfd.budget < 60000]

In [ ]:
"""
DELETE FROM Employees
  WHERE Department IN
  (
    SELECT Code FROM Departments
      WHERE Budget >= 60000
  );
""";

## Delete from the table all employees.

In [ ]:
dfe = pd.DataFrame(columns=dfe.columns)
dfe

In [ ]:
"""

DELETE FROM Employees;
""";

In [ ]:
schema = sdfe.schema
empty = spark.createDataFrame(sc.emptyRDD(), schema)

empty.show()

# Time taken

In [ ]:
time_taken = time.time() - time_start_notebook
h,m = divmod(time_taken,60*60)
print('Time taken: {:.0f} hr {:.0f} min {:.0f} secs'.format(h, *divmod(m,60)))